
CREATE TABLE pic(
    lid         INT,
    src VARCHAR(256),
    pname VARCHAR(100),
    pscore VARCHAR(50),
    vip  VARCHAR(50),
    kind   VARCHAR(10),
    hot    VARCHAR(26),
    vipkind  VARCHAR(20),
    juzhong  VARCHAR(10),
    details  VARCHAR(800)
);
INSERT INTO pic VALUES
('1','img/meiju1.jpg','权力的游戏 Game of Thrones','用户评分：9.4','会员专享','美剧','钻石','z','m','故事从维斯特洛大陆边境处发现远古传说中早已灭绝的生物开始，预示着危险即将到来。而这片大陆的临冬城主暨北境统领艾德·史塔克（肖恩·宾饰）的家族也迎来了老友兼国王劳勃·拜拉席恩（马克·阿蒂饰）的来访。国王希望艾德·史塔克能担任首相一职，对抗企图夺取铁王座的叛军。危情一触即发，整个王国看似平和的表面下却是波涛暗涌。权高位重的拜拉席恩家族、勇敢善良的史塔克家族、企图谋取王位的坦格利安家族、有着不可告人秘密的兰尼斯特家族。这些家族各怀鬼胎，国王的意外身亡，使国家马上陷入无尽的战乱之中。'),
('2','img/meiju2.jpg','瑞克和莫蒂 Rick and Morty','用户评分：9.2','会员专享','美剧','银牌,金牌,钻石','y','m','Rick（瑞克）和Morty（莫蒂）讲述了地球C-137（S1-06之后转移到的时空，之前的时空由于Rick的药水使除了Morty一家的人类都变成了柯南伯格式的怪物，并且那个时空编号未知）的Rick和Morty的冒险故事，但有时也有Rick和Summer，Morty和Jerry这样的冒险组合。剧情设计和制作手法都极为出彩。'),
('3','img/meiju3.jpg','纸牌屋 House of Cards','用户评分：8.5','会员专享','美剧','钻石','z','m','弗兰西斯·安德伍德是一位极具政治野心的南卡罗来纳州民主党众议员、众议院多数党党鞭。他帮助加勒特·沃克赢得大选成为第45任美国总统，而沃克作为回报则许诺将任命他为国务卿。然而，在沃克宣誓就职之前，白宫幕僚长琳达·瓦斯奎兹却告知安德伍德，称总统希望将他留在国会推动法案通过，因而将不会提名他作国务卿。安德伍德对总统的背叛之举愤怒不已，他决定单干倒戈，逐步实现自己的总统梦想。'),
('4','img/meiju4.jpg','硅谷 Silicon Valley','用户评分：9.1','会员专享','美剧','金牌,钻石','j','m','《硅谷》为半小时HBO全新原创自制喜剧影集，场景设定在充满淘金色彩的美国硅谷，在那里，最有办法成功的人们往往却是最没办法处理其“功成名就”的人。由年轻喜剧演员与老牌明星联合主演，《硅谷》叙说着一位住在“骇客旅社”的内向电脑工程师与他朋友们的故事。这群不太能融入社会的家伙被一位网路公司的百万富翁“关照”着，他允许这群工程师免费住在他的房子，不过条件是要取得他们专案的10%股份。《硅谷》全剧拍摄于洛杉矶和帕洛阿托市，演员阵容包括Thomas Middleditch、TJ Miller、Zach Woods、Kumail Nanjiani、Martin Starr、Josh Brener、Christopher Evan Welch，以及Amanda Crew。Tom Lassally和Scott Rudin将出任执行制作。本部戏是由Judge、Altschuler，以及 Krinsky所创作。'),
('5','img/meiju5.jpg','疑犯追踪 Person of Interest','用户评分：9.3','会员专享','美剧','银牌,金牌,钻石','z','m','软件天才芬奇（Finch）发明了一个程序，通过观测已有的模式来识别有可能进行暴力犯罪的罪犯，他雇用了一位被推定死亡的前美国空军特种部队队员和前CIA里瑟（Reese），二人使用国家级的监测技术，加以Reese的专业技能和Finch的无限财富，开始“法外执法”，力图在犯罪发生前就对其加以阻止。Reese的行动引起了纽约市警察局的注意，其中包括警探Carter和Fusco。面对无数的犯罪调查，Reese和Finch发现能够改变一切的关键就是找到正确的人、正确的信息和正确的时间。'),
('6','img/meiju6.jpg','王冠 The Crown【试看+购买】','用户评分：9.3','会员专享','美剧','金牌,钻石','j','m','《王冠》的前几集由斯蒂芬·道德利（ Stephen Daldry）执导，由他导演的舞台剧《观众》（The Audience）中，伊丽莎白二世仍由“女王专业户”米伦扮演。故事的序幕从伊丽莎白公主下嫁菲利普的1947年拉开。之后的1952年2月6日，在肯尼亚访问的伊丽莎白收到父亲乔治六世的死讯，回国继承了王位，她的加冕礼直到一年后才在威斯敏斯特大教堂举行。摩根将记录她作为女王期间取得的个人、政治和社会上的成功，以及动荡局面。
知情人称，光是选角可能就要花费数月的时间。刚刚登基的伊丽莎白年仅26岁，年轻貌美，高贵迷人，将由一位风华正茂的女演员扮演，30岁到40岁之间应选一位中年演员，还有就是老年扮演者。现在制作方考虑的是第三位女演员是否能一直演到她90岁，因为照现在的情形看，2016年剧集上演时，女王很可能依然健在。如果70岁以后再换人，那么就需要四个演员。
一位执行制片人说：“演员必须是英国人，因为我觉得人们不会支持由一位外国人来扮演英国女王。此外还有好百几个角色要确定演员，从首相到各国领导人，比如她接见过的美国总统，纳尔逊·曼德拉（Nelson Mandela）可能也在其中。别忘了菲利普亲王，他也是个重要人物，可能也要分几个人来演。还有查尔斯、戴安娜、卡米拉、威廉、凯特，他们所有人。”
《王冠》由安迪·哈里尔斯（Andy Harries）监制、影业电视制作公司出品，BBC与ITV一直在激烈争夺该剧的版权，但最终Netflix渔翁得利，获得在英国和世界各地的首播权。英国广播公司现在只能退而求其次，看谁能取得电视播映权。'),
('7','img/yingju1.jpg','唐顿庄园 Downton Abbey【试看+购买】','用户评分：9.0','会员专享','英剧','银牌,金牌,钻石','y','y','1912-1914年，英国国王乔治五世在位时期，唐顿庄园的格兰瑟姆伯爵（The Rt Hon The Earl of Grantham）一家，因家产继承问题而引发的种种纠葛和摩擦，呈现了英国上层贵族与其仆人们在森严的等级制度下的人间百态，剧情跌宕起伏。
故事以1912年4月英国白星公司游轮泰坦尼克号沉没为引子，讲述了克劳利家族和仆人的日常生活，一直持续到1914年第一次世界大战爆发。
故事的焦点集中在格兰瑟姆产业的继承人问题上。在现任伯爵罗伯特·克劳利（Robert Crawley, Earl of Grantham）还是继承人的时候，同豪门出身的美国女子珂拉·克劳利（Cora Crawley, Countess of Grantham）结婚，解决了伯爵府的资金困境。但是，伯爵夫妇婚后只育有三个女儿，而依照规矩，格兰瑟姆伯爵的头衔及产业只能由男性继承人继承。伯爵的长女玛丽（Lady Mary Crawley）一直暗中物色合适的夫婿，不过过程并不顺利。
与此同时，庄园产业的假定继承人在泰坦尼克号沉没的事故中丧生，依照规矩，他们的远房亲戚，一位曼彻斯特的年轻律师——马修·克劳利（Matthew Crawley），成为了最有可能的继承人。随着新的继承人的到来，整个庄园都发生着新的故事。'),
('8','img/yingju2.jpg','9号秘事 Inside No.9【试看+购买】','用户评分：9.0','会员专享','英剧','金牌,钻石','j','y','在接受英媒采访时，佩姆伯顿透露第三季是“特别黑暗的一季，其中有两三集我们将恐怖惊悚元素推向了新高度。”这一季依然会由六个独立故事组成，故事发生的位置总与9号有关，一座1978年的阿尔卑斯山小木屋、一家关门之后的餐馆、一间艺术馆和一个KTV包房成为第三季上演好戏的舞台。'),
('9','img/yingju3.jpg','布莱克书店 Black Books【试看+购买】','用户评分：9.0','会员专享','英剧','钻石','z','y','伯纳·布莱克（迪兰·莫兰 Dylan Moran 饰）是伦敦最荒唐的书店店主。他的书店脏乱不堪，营业时间随心所欲，财务状况乱七八糟。伯纳自己则是蓬头垢面，嗜烟好酒，脾气暴躁。书店打烊的时间也随心所欲，想打烊了就拿着扩音器和扫帚驱赶顾客，还会因为懒得订书而不愿把书卖光。弗兰（ 塔姆辛·格雷格 Tamsin Greig 饰）是伯纳唯一的女性朋友，在书店隔壁开一家干净整洁的精品店，但她对布莱克书店里的脏乱却熟视无睹。喜欢搜集各种稀奇古怪的玩意儿。经常过来跟伯纳聊天喝酒。她想法独特、做事夸张，经常语出惊人。比起神经质的伯纳，她在人际关系上正常多了，但遗憾的是，她的爱情生活却一直毫无结果。
一天伯纳的会计逃跑了。没了会计的伯纳算账到抓狂，崩溃之际遇到了曼尼（比尔·贝利 Bill Bailey 饰）。曼尼虽然经常神经兮兮，做事也迷糊，但他性格随和，受到弗兰和顾客们的欢迎。伯纳在弗兰逼迫下不情愿的聘用了曼尼，从此布莱克书店里每天都上演着令人捧腹的荒诞戏码。'),
('10','img/yingju4.jpg','神探夏洛克 Sherlock【试看+购买】','用户评分：9.0','会员专享','英剧','钻石','z','y','在莱辛巴赫坠楼案两年后，华生努力让生活重新步上正轨，集美丽与智慧于一身的玛丽·摩斯坦（阿曼达·艾宾顿饰）将与华生一同步入和谐浪漫的人生新阶段。然而此刻，夏洛克却上演复活戏码，虽然这是华生祈祷已久的愿望，但当愿望实现时，他还是无法坦然面对一切。这一次，夏洛克和华生需要解决伦敦街道下神秘的阴谋、婚礼上突如其来的意外，以及面对恶名昭彰且阴险的勒索之王——查尔斯·奥古斯都·马格努森（即原著米尔沃顿，拉斯·米科尔森饰）。夏洛克回来了，但一切还和以前一样吗？'),
('11','img/yingju5.jpg','皇家律师 Silk【试看+购买】','用户评分：9.0','会员专享','英剧','钻石','z','y','这里汇聚了各种律师，他们各具本领，各显神通。Martha Costello（玛辛·佩克 Maxine Peake 饰）是一个三十多岁，单身，但依旧富于激情的辩护律师。Martha面临着极具挑战的案件以及令她惊讶的客户。她的信念、她的偏见、她的良知的极限在刑事司法系统中被一系列的课程所检验，Clive Reader（鲁伯特·潘瑞-琼斯 Rupert Penry-Jones 饰）和Martha年龄相同。但他为人风趣，有天赋但同时也很精明。两人同时都是律师，同时都申请了皇家律师资格，在庭上的表现直接影响他们的命运，而Clive知道如何来玩这场游戏......'),
('12','img/yingju6.jpg','福斯特医生 Doctor Foster【试看+购买】','用户评分：9.0','会员专享','英剧','银牌,金牌,钻石','y','y','在别人眼中，福斯特医生杰玛（苏兰·琼斯饰）有着令人羡慕的一切，工作受人尊敬，家庭幸福和睦，夫妻恩爱甜蜜，孩子乖巧听话。其实她自己也一直这样认为，直到有一天，一支唇膏，一根金发的出现，让她开始怀疑眼前的一切。为了查清楚丈夫西蒙（博迪·卡维尔饰）是否真的出轨，她甚至利用病人帮她跟踪丈夫，结果却发现事情的真相，完全在她的预料之外。'),
('13','img/riju1.jpg','胜者即是正义 リーガル・ハイ','用户评分：9.0','会员专享','日剧','银牌,金牌,钻石','y','r','在早稻田大学法学部毕业后加入三木律师事务所进行律师职业修炼的菜鸟律师黛真知子（新垣结衣饰）为了帮一起谋杀案的当事人洗刷清白，在同为律师又是自己老板的三木长一郎社长的私人秘书泽地（小池荣子饰）的指点下找到了有着各种评价的传奇律师古美门研介（堺雅人饰）来指导自己。古美门研介拥有极高天分的辩护才能，为了赢得胜利不惜使用任何手段。由他成为律师出道至今仍然保持着百分百的骄人全胜纪录，也曾经是三木长一郎（生濑胜久饰）麾下的得意门生。但是因某起事件的发生导致这两大律师界巨擘最后决裂。由于菜鸟律师在拜托时提到的丰厚报酬，令腹黑又贪钱的古美门产生浓厚兴趣；看在巨额律师费的份上古美门律师最后同意出山，最后他在法庭上凭借自己巧舌如簧、颠倒黑白的能力赢得诉讼。在此之后，作为菜鸟的黛加入了古美门律师事务所继续自己作为律师的修行，而接下来一连串的官司又将古美门和三木沉疴已久的旧怨重新摆上桌面。'),
('14','img/riju2.jpg','海女 あまちゃん【试看+购买】','用户评分：9.0','会员专享','日剧','银牌,金牌,钻石','y','r','厌烦了家乡一成不变的生活，24年前，对大都市东京满怀憧憬的天野春子（小泉今日子 饰）在北三陆电车开通首日离家出走。此去经年，早已成家但生活并不舒心的春子接到母亲病危的短信，于是带着女儿秋（能年玲奈 饰）返回家乡。如之前所料，这一切不过是好友大向大吉（杉本哲太 饰）的骗局，其目的是希望春子能够接替母亲夏（宫本信子 饰），继承当地有着悠久历史且即将消亡的海女职业。存有深深芥蒂的母女俩针锋相对，争执不断；而从未与外婆谋面的秋却深深为碧海蓝天以及海女所吸引。经过数日盘桓，被东京压抑的空气逼迫得喘不上气来的秋作出人生中重要的决定，那就是留下来成为一名海女。 '),
('15','img/riju3.jpg','东京爱情故事 東京ラブストーリー【试看+购买】','用户评分：9.0','会员专享','日剧','钻石','z','r','故事讲述由抱着不安而由爱媛到东京的完治 （织田裕二饰） ，在机场莉香 （铃木保奈美饰） 以令人回复冲动的笑颜迎接完治，在二人工作同时，莉香亦开始爱上了完治，但完治心中所爱的是由高中时代一直暗恋着的里美，但里美所爱的却又是三上 （江口洋介饰） 。造成一个四角关系，就算完治心仍是向着里美，但莉香却无减对完治的关系。终于把完治的心敲开了，正当完治与莉香二人生活过得甜蜜同时，三上及里美之间竟又插入三上的同学尚子。尚子虽然有未婚夫，但对三上却又欲断难断。里美知道，与三上最终只有分离……伤心欲绝之时，在身边慰勉的人只有完治，里美此时才醒觉自己是原来是爱完治，亦因此完治与莉香之间开始决裂，莉香不欲完治受多方压迫，更知此感情无可挽留，毅然人间消失。完治回故乡爱媛寻找莉香，亦于爱媛与莉香正式分手，从此莉香下落不明，三年后，三上与尚子正式结婚之日，已成夫妇的完治与里美于回家路上竟遇莉香，莉香对着完治的仍是那令人回复冲动的笑容。'),
('16','img/riju4.jpg','对不起青春 ごめんね青春！【试看+购买】','用户评分：9.0','会员专享','日剧','金牌,钻石','j','r','暂无'),
('17','img/riju5.jpg','母亲 Mother【试看+购买】','用户评分：9.0','会员专享','日剧','银牌,金牌,钻石','y','r','暂无'),
('18','img/riju6.jpg','交响情人梦 のだめカンタービレ【试看+购买】','用户评分：9.0','会员专享','日剧','钻石','z','r','暂无'),
('19','img/hanju1.jpg','未生 Incomplete Life【试看+购买】','用户评分：9.0','会员专享','韩剧','钻石','z','h','暂无'),
('20','img/hanju2.jpg','心里的声音 Your Voice【试看+购买】','用户评分：9.0','会员专享','韩剧','金牌,钻石','j','h','暂无'),
('21','img/hanju3.jpg','信号 Signal【试看+购买】','用户评分：9.0','会员专享','韩剧','钻石','z','h','暂无'),
('22','img/hanju4.jpg','他们生活的世界 he World That They Live In【试看+购买】','用户评分：9.0','会员专享','韩剧','钻石','z','h','暂无'),
('23','img/hanju5.jpg','太阳的后裔 Descendants of the Sun【试看+购买】','用户评分：9.0','会员专享','韩剧','银牌,金牌,钻石','y','h','暂无'),
('24','img/hanju6.jpg','秘密森林 Forest of Secrets【试看+购买】','用户评分：9.0','会员专享','韩剧','银牌,金牌,钻石','y','h','暂无');
CREATE TABLE vip(
    vid INT,
    vsrc VARCHAR(50),
    vprice VARCHAR(50),
    detail VARCHAR(80),
    allkind  VARCHAR(30),
    kind   VARCHAR(50),
    vkind   VARCHAR(10)
);
INSERT INTO vip VALUES
(1,'img/yin.png','¥100.00/年','可免费观看本站内银牌会员专享视频','添加 "银牌会员" 至您的购物车','银','银牌会员'),
(2,'img/jin.png','¥150.00/年','可免费观看本站内金牌会员专享视频','添加 "金牌会员" 至您的购物车','金','金牌会员'),
(3,'img/zuan.png','¥180.00/年','可免费观看本站内钻石会员专享视频','添加 "钻石会员" 至您的购物车','钻','钻石会员');
CREATE TABLE usera(
    unum VARCHAR(11),
    upwd VARCHAR(18)
);
INSERT INTO usera VALUES(
'18137785593','123456'
);
CREATE TABLE manage(
    lid         INT,
    pname VARCHAR(100),
    pscore VARCHAR(50),
    vip  VARCHAR(50),
    kind   VARCHAR(10)
);
INSERT INTO manage VALUES
('1','权力的游戏 Game of Thrones','用户评分：9.4','会员专享','美剧'),
('2','瑞克和莫蒂 Rick and Morty','用户评分：9.2','会员专享','美剧'),
('3','纸牌屋 House of Cards','用户评分：8.5','会员专享','美剧'),
('4','硅谷 Silicon Valley','用户评分：9.1','会员专享','美剧'),
('5','疑犯追踪 Person of Interest','用户评分：9.3','会员专享','美剧'),
('6','王冠 The Crown【试看+购买】','用户评分：9.3','会员专享','美剧'),
('7','唐顿庄园 Downton Abbey【试看+购买】','用户评分：9.0','会员专享','英剧'),
('8','9号秘事 Inside No.9【试看+购买】','用户评分：9.0','会员专享','英剧'),
('9','布莱克书店 Black Books【试看+购买】','用户评分：9.0','会员专享','英剧'),
('10','神探夏洛克 Sherlock【试看+购买】','用户评分：9.0','会员专享','英剧'),
('11','皇家律师 Silk【试看+购买】','用户评分：9.0','会员专享','英剧'),
('12','福斯特医生 Doctor Foster【试看+购买】','用户评分：9.0','会员专享','英剧'),
('13','胜者即是正义 リーガル・ハイ','用户评分：9.0','会员专享','日剧'),
('14','海女 あまちゃん【试看+购买】','用户评分：9.0','会员专享','日剧'),
('15','东京爱情故事 東京ラブストーリー【试看+购买】','用户评分：9.0','会员专享','日剧'),
('16','对不起青春 ごめんね青春！【试看+购买】','用户评分：9.0','会员专享','日剧'),
('17','母亲 Mother【试看+购买】','用户评分：9.0','会员专享','日剧'),
('18','交响情人梦 のだめカンタービレ【试看+购买】','用户评分：9.0','会员专享','日剧'),
('19','未生 Incomplete Life【试看+购买】','用户评分：9.0','会员专享','韩剧'),
('20','心里的声音 Your Voice【试看+购买】','用户评分：9.0','会员专享','韩剧'),
('21','信号 Signal【试看+购买】','用户评分：9.0','会员专享','韩剧'),
('22','他们生活的世界 he World That They Live In【试看+购买】','用户评分：9.0','会员专享','韩剧'),
('23','太阳的后裔 Descendants of the Sun【试看+购买】','用户评分：9.0','会员专享','韩剧'),
('24','秘密森林 Forest of Secrets【试看+购买】','用户评分：9.0','会员专享','韩剧');